/*서브페이지 자바스크립트*/
var bsh3 =[
    "기억의 문이 열리고 모험이 시작된다!",
    "저승과 이승을 오가는 환상적인 모험",
    "위기의 저널리즘, 이 시대 최고의 지성이 파헤친 언론의 천태만상!",
    "베르베르가 이번에는 고양이의 눈으로 인간의 미래를 바라본다",
    "공쿠르상과 영국 추리 작가 협회상 동시 수상 작가 거장 르메르트의 문학성 넘치는 스릴러!"
]

var bspp = [
    "꾸준히 신작을 발표해 온 베르베르는 이번에 &lt;기억&gt;이라는 테마로 시공간을 넘나들며 자신만의 독특한 세계관을 확장해 나간다.<br>주인공 르네 톨레다노는 고등학교에서 역사를 가르치는 교사이다. 그는 센강 유람선 공연장 &lt;판도라의 상자&gt;에 갔다가 퇴행 최면의 대상자로 선택당한다. 최면에 성공해 무의식의 복도에 늘어선 기억의 문을 열 수 있게 된 르네.문 너머에서 엿본 기억은, 제1차 세계 대전의 전장에서 목숨을 잃은 그의 전생이었다. 최면이 끝난 후에도 너무나 생생하고 강렬한 기억에 시달리던 그는 몸싸움에 휘말려 의도치 않게 사람을 죽이고 경찰에 자수할지 말지 고민하며 초조한 나날을 보내게 된다.<br>한편 르네는 자신에게 총 111번의 전생이 있었다는 사실을 알고 제1차 세계 대전 참전병 외에도 여러 기억의 문을 열어 본다.그중에서도 최초의 전생은 놀랍게도 현대인이 &lt;아틀란티스&gt;라고 부르는 전설 속의 섬에 사는 남자 게브였다. 아틀란티스가 바닷속에 잠겨 버렸다고 알고 있는 르네는 어떻게든 게브를 구하고 싶어 하고,&lt;판도라의 상자&gt; 무대에서 만났던 최면사 오팔이 르네의 조력자를 자처한다. 현생에서는 경찰에 쫓기며 정신병자 취급을 받고, 전생에서는 대홍수가 예고된 가운데 과연 르네와 게브의 운명은?",
    
    "개미나 고양이, 천사와 신 등 독특한 시선으로 인간 세상을 바라보는 베르베르는 이번에는 떠돌이 영혼의 시점에서 소설을 전개해 나간다.<br>&lt;누가 날 죽였지?&gt; 소설의 주인공 가브리엘 웰즈는 이런 문장을 떠올리며 눈을 뜬다. 그는 죽음에 관한 장편소설의 출간을 앞두고 있는 인기 추리 작가다. 평소에 작업하는 비스트로로 향하던 그는 갑자기 아무 냄새도 맡을 수 없다는 사실을 깨닫고 서둘러 병원으로 향한다. 그러나 의사는 그를 없는 사람 취급하고, 거울에 모습이 비치지 않을 뿐 아니라, 창문에서 뛰어내려도 이상이 없다. 그는 죽은 것이다.<br>가브리엘은 자신의 갑작스러운 죽음이 살인이라고 확신한다. 머릿속에는 몇몇 용의자가 떠오른다. 다행히 그는 자신의 목소리를 들을 수 있는 영매 뤼시 필리피니를 만난다. 떠돌이 영혼이 된 가브리엘은 저승에서, 영매 뤼시는 이승에서 각자의 수사를 해나가며 진실을 파헤치기 시작한다.",
    
    "우리 시대의 가장 영향력 있는 사상가, 권위 있는 기호학자이자 뛰어난 철학자, 역사학자, 미학자, 그리고 전 세계적인 인기를 누린 베스트셀러 소설가 ― 움베르토 에코의 마지막 소설 『제0호』가 열린책들에서 출간되었다. 이탈리아에서만 25만 부 이상의 판매고를 올리며 미국, 프랑스, 스페인, 일본, 폴란드, 러시아 등 전 세계 40개국 이상에서 출간 또는 출간을 앞두고 있다.<br>토마스 아퀴나스에서부터 대중문화에 이르기까지 다양한 영역을 넘나들며 시대를 대표하는 지성으로 존경받은 에코의 작품들은 전무후무한 베스트셀러로 오랜 시간 독자들의 열광을 불러일으켰다. 데뷔작이자 대표작인 『장미의 이름』은 40개국 이상에서 번역되었으며 전 세계에서 3천만 부 이상이 팔렸고 동명의 영화로도 제작되었다. 이 작품으로 에코는 1981년 이탈리아 스트레가상을, 1982년 프랑스 메디치 외국 문학상을 받았다. 에코는 2016년 2월 19일 췌장암으로 별세했다. 2015년 출간된 그의 마지막 소설 『제0호』는 정보의 홍수 속에 사는 현대인에게 &lt;올바른 저널리즘&gt;에 대한 묵직한 질문을 던진다. 공정성을 잃은 보도와 음모론적 역설(力說)의 난장, 뚜렷한 방향 없는 단말마의 포르노적 정보 공세. 일찍이『 푸코의 진자』,『 프라하의 묘지』 등에서 다뤘듯 음모론을 둘러싼 대중의 망상에 오랜 시간 흥미를 가져온 에코는 저널리즘의 편집증을 목록화해 펼쳐 보인다.",
    
    "『고양이』는 제목 그대로 주인공인 고양이의 시각에서 인간의 문명을 바라보는 작품으로, 프랑스에서는 작년 한국에서도 베스트셀러가 되었던 『잠』보다 높은 인기를 누렸다(프랑스에서 현재까지 30만 부 판매). 파리에서 살고 있는 암고양이 바스테트. 그녀는 ‘집사’가 틀어 놓은 TV 화면과 점점 잦아지는 골목길의 총성을 통해 그동안 당연시하던 안락한 일상이 조금씩 무너지고 있음을 감지하게 된다. 이 무렵 바스테트는 옆집에 이사 온, 어떤 이유에선지 인간 세계에 대해 ‘너무 많이 아는’ 고양이 피타고라스와 친구가 되는데…….<br>인간이 상상하기 어려운 타자의 시각을 도입하여, 인간 중심주의를 해체하고 이 지구에서 인간이 차지해야 할 적절한 위치를 끊임없이 고민해 온 베르베르의 작업은 이미 첫 번째 작품인 『개미』에서부터 시작된 것이지만, 이번 『고양이』에서는 그 문제의식이 그동안 좀 더 성숙해지고 발전해 왔음을 알게 된다. 베르베르가 보기에, 이 지구상의 생물종들과의 대화는 필요하다. 단지 인간의 어떤 흥밋거리나 지식의 확장을 위해서가 아니라, 인간이 전쟁과 테러 등 자기 파괴적인 경로에서 벗어날 수 있는 해답이 여기에 있기 때문이다. 무거운 주제를 경쾌하게 다룰 줄 알고, 과학과 철학, 그리고 역사의 에피소드들을 유머러스하게 버무리는 베르베르의 솜씨는 여전하다.",
    "현재 프랑스에서 가장 인기 있는 작가의 한 명인 피에르 르메트르의 신작 소설 『사흘 그리고 한 인생』이 임호경 번역으로 열린책들에서 출간되었다. 르메트르는 프랑스 최고 문학상인 공쿠르상 수상 작가이면서, 영국 추리 작가 협회상도 수상한 희귀한 작가이다. 『사흘 그리고 한 인생』은 공쿠르상 수상작이었던 『오르부아르』(「맨 오브 마스크」라는 제목으로 4월 국내 개봉)에 이어 발표된 소설로, 곧바로 베스트셀러가 되었고 프랑스에서 현재까지 35만 부가 판매되었다. 무대를 다시 현대로 옮겨, 추리 작가, 스릴러 작가로서 르메트르의 진면목을 유감없이 보여주고 있는 작품이다. <br>시골에서 사는 열두 살 소년 앙투안. 그는 우연한 사고로 동네 꼬마를 죽이고 만다. 두려움에 사로잡힌 앙투안은 숲에 꼬마의 시체를 숨긴다. 시체는 결코 발견되지 않았고 아무도 그를 의심하지 않았다 -- 12년이 지나도록. 이제 앙투안은 단 하루도 잊은 적이 없는 그날의 기억에서 슬슬 떠나도 좋은 것일까? 이때 갑자기 그가 그토록 싫어하는 고향에 내려가 보지 않을 수 없는 일이 생기는데……."
]

$(function () {
    var wbg = $(".wbg .bsintro");

    var bstxt = $(".bstxt_tit");
    
    

    bstxt.click(function (e) {
        e.preventDefault();
        $(".wbg").show();
        //베스트셀러 사진 주소
        var bsimg_html = $(this).parent().parent().parent().find(".bsimg").html();
        //console.log(bsimg_html);
    wbg.find(".bsintro_img").empty().append(bsimg_html);
        
        //베스트셀러 이름주소
        var bstxt_name = $(this).find("a").html();
    wbg.find("h2").empty().append(bstxt_name);
        
        //h3에 바로 설명넣기
        var bsnumber = $(this).parent().parent().parent().index();
    wbg.find("h3").empty().append(bsh3[(bsnumber-1)]);
        //console.log(bsnumber);
        
        //p 설명넣기
        wbg.find("p").empty().append(bspp[(bsnumber-1)]);
    });///////////베스트셀러 제목 클릭시////////////


    $(".bsintro_x").click(function (e) {
        e.preventDefault();
        $(".wbg").slideUp(500);
    });









}); /*제이쿼리영역*/
