/*서브페이지 자바스크립트*/
var bsh3 =[
    "아동의 마음에 천착해 온 일본 아동 정신과 전문의, 임상 심리학자 다키카와 가즈히로의 <아동 정신 의학의 기본서>",
    "중국, 어떻게 상대할 것인가. 현대 중국의 도약기를 다룬 독보적인 회고록<br> 2015 마크 저커버그〈책의 해〉추천 도서",
    "130여 개 임상 시험으로 확인한 비타민, 허브, 기능 식품의 항바이러스 효과와 과학적으로 입증된 영양제들의 항바이러스 효과",
    "죽고 난 다음에 시작되는 특별한 심판",
    "남성에서 여성이 되어 수백 년을 살아온 한 시인의 놀라운 일대기<br>버지니아 울프의 걸작 환상 소설"
]

var bspp = [
    "정신 장애를 가진 아이들을 이해하고, 소통하는 데 든든한 토대가 되어줄 도서 『아이를 위한 정신 의학』이 열린책들에서 출간되었다. 일본의 아동 정신과 전문의이자 임상심리학자인 다키카와 가즈히로가 2018년에 발표한 책의 한국어판이다. 저자는 이 책에서 자신이 일생 연구해 오고 발전시켜 온 마음과 정신 발달에 대한 융합적 관점과 철학을 흥미롭게 풀어냈다.<br>아이의 한 번뿐인 인생 중에 마음의 병이나 실조, 장애가 있다면, 그리고 그런 아이를 돌봐야 한다면 무엇이 필요할까. 이 책은 어린이의 정신 장애에 대해 설명과 소개만이 아닌, '기본적인 사고방식과 자세'의 토대를 제공한다. 어린 아이를 <위한> 정신 의학 책이지 어린 아이의 정신 의학 책이 아니기 때문이다. 일반적으로 알려진 정신 장애에 관한 통념과는 다른 사고방식과 새로운 관점을 비중 있게 서술했으며, <장애>라고 불리는 개념과 이해가 꼭 필요한 사람들을 위해 풀어 쓴 알기 쉬운 백과사전의 역할도 하고 있다.<br>부모는 물론 교사, 보육사, 간호사, 심리 상담사 등 일상에서 아이들과 직접 관계되는 사람들이 이 책을 보고 적절히 응용할 수 있을 것이다. 발달 장애부터 아동 학대, 트라우마, 등교 거부나 집단 괴롭힘의 문제까지 폭넓은 분야를 다룸으로써 사회 구조의 변화에 따라 다양하게 변해 가는 정신 장애의 양상을 차근히 짚어볼 수도 있다. 이 책에 나와 있는 내용을 모르고서는 아이의 정신 장애의 근원적인 이해를 얻기는 어려울 것이다. 정식 의학적인 전문 지식과 경험이 없는 독자도 알기 쉽게 써내려 간 저자의 정성에 감탄한다.",
    
    "세계적인 투자 은행 골드만 삭스의 최고 경영자(1999~2006)이자 미국의 74대 재무 장관(2006~2009)을 지낸 헨리 M. 폴슨 주니어가 1992년부터 2014년까지 중국과 상대했던 경험을 담은 회고록이다.<br>폴슨은 독보적인 방식으로 중국을 상대해 온 자타공인 미국 최고의 중국통이다. 골드만 삭스 시절에는 중국 국유 기업들의 기업공개를 주도하며 중국 경제를 세계무대 위로 끌어올렸고, 재무 장관 시절에는 미중 전략경제대화(미국과 중국이 양자 현안 및 세계 이슈 등을 폭넓게 논의하는 연례회의)를 통해 미중 간의 긴밀한 협력 관계를 이끌었다. 25년간 100차례 넘게 중국을 왕래하며 특유의 친화력과 탁월한 실행력을 바탕으로 장쩌민, 주룽지, 후진타오, 시진핑 등 전현직 국가주석 세 명을 비롯해 현대 중국의 엘리트들과 전례 없는 교유를 나눴다. 폴슨은 자신의 경험을 바탕으로 이 책에서 독자들이 가장 궁금해할 만한 핵심 질문들에 답한다. <br>중국은 어떻게 그토록 빨리 경제 대국으로 성장했는가? 중국에서는 실제로 어떤 방식으로 일이 진행되는가? 중국과 협력·경쟁하는 동시에 그들로부터 이득을 얻는 최선의 방법은 무엇인가?<br>폴슨은 현대 중국의 도약기를 함께한 참여자이자 목격자로서 중국식 자본주의의 탄생과 진화에 얽힌 숨은 이야기를 들려주고, 새로운 경제적 위협으로 떠오른 중국을 어떻게 상대해야 하는지 올바른 이해와 접근법을 제시한다. 특히 경제 대국을 건설하고 있는 중국의 지도자들과 관계 맺는 방법을 다룬 아주 보기 드문 저술이다.",
    
    "『전문의가 처방하는 바이러스를 이기는 영양제』가 열린책들에서 출간되었다. 이 책은 근거 중심의 영양 치료에 앞장서는 가정의학 전문의 김경철과 김해영이 전하는 영양과 인간 몸의 면역 시스템에 관한 친절한 가이드이다. 특히 항바이러스에 효과가 있는 영양소를 중심으로 최신의 코로나19 바이러스 관련한 다양한 항바이러스 임상 시험의 내용을 소개하고, 이를 바탕으로 각 영양소와 영양제의 섭취 방법 및 주의할 점을 독자들이 한눈에 알아볼 수 있도록 실용적으로 제시한다. 이미 영양제 수요가 많아지고 있는 현재, 무분별하고 과도한 영양제 비즈니스 속에서 개인이 알아야 할 영양에 대한 기본 지식을 갖추고 더불어 각자에게 필요한 영양제를 스스로 챙길 수 있도록 인간의 면역 시스템과 항바이러스 작동 방식에 관한 전문적인 내용을 쉽게 풀어 알차게 구성했다.<br>두 전문의는 주변에서 쉽게 구할 수 있고 쉽게 추천하며 또한 매일 복용하는 일상적이고 개인적인 영양제 경험에도 최소한의 근거를 갖춰야 하며, 그것이 개인적인 경험을 넘어서, 보편적인 지식으로 이어지되 다양한 상황에 따라서 달리 적용될 수 있음을 주의해야 한다고 말한다. 흔히 몸에 좋다고 잘 알려진 영양소나 기능성 식품이 인플루엔자나 코로나19 같은 바이러스 질환도 예방할 수 있을까? 이에 대한 임상적 근거는 실은 여전히 부족하다. 이러한 현실에서 두 전문의의 현장에서의 경험이 좋은 토대가 된다. 두 저자는 다양한 연령대와 상황에 처한 사람들의 진료 경험을 통해 다양하게 이루어진 국내외의 임상 시험과 의학 논문에서 보편적으로 적용될 만한 주요 영양소 18가지를 선택했으며 이것이 어떻게 바이러스를 예방하고, 어떠한 효과를 나타내는지 그리고 어떻게 섭취하는 것이 가장 효과적이며, 주의할 점은 무엇인지를 서술했다. 임시적이고 과장된 정보보다는 과학적이고 안전한 정보를 근거로 바이러스 장기화의 시대에 개인이 스스로의 면역력을 정확하게 관리할 수 있도록 하는 것이 이 책의 기획 의도이다. ",
    
    "『심판』은 베르베르가 『인간』 이후 다시 한번 시도한 희곡이며, 천국에 있는 법정을 배경으로 판사 · 검사 · 변호사 · 피고인이 펼치는 설전을 유쾌하게 그려 냈다. 베르베르 특유의 상상력과 유머가 빛나는 이 작품은 희곡이면서도 마치 소설처럼 읽힌다. 원제는 <천국에 오신 것을 환영합니다Bienvenue au paradis>이며 2015년 프랑스에서 출간되어 4만 부 이상 판매되었다. 프랑스에서는 2017년, 2018년, 2019년 세 차례에 걸쳐 무대에 올려진 바 있다.<br>『심판』은 총 3막으로 구성되어 있다. 제1막에서는 수술 중 사망한 주인공이 자신이 죽었다는 사실을 깨닫지 못한 채 천국에 도착하여 변호사 · 검사 · 판사를 차례로 만난다. 제2막은 주인공의 지난 생을 돌이켜보는 절차가 진행되며, 제3막은 다음 생을 결정하는 절차가 진행된다.<br>주인공은 방금 전 사망한 아나톨 피숑. 살아 있을 때 판사로 일했던 그는 아이러니하게도 죽자마자 피고인의 처지가 된다. 골초였던 그는 폐암에 걸렸고, 인력이 부족한 휴가철 한복판에 수술을 받았지만 결국 소생하지 못한다. 그는 이제 심판에 따라 천국에 남아 있을 수도 있고, 아니면 다시 태어나야 할 수도 있다.<br>아나톨은 자신이 좋은 학생, 좋은 시민, 좋은 남편 및 가장, 좋은 직업인으로 살았다고 주장하고, 아나톨의 수호천사이자 변호를 맡은 카롤린 역시 어떻게든 그의 좋은 점을 부각하려 노력한다. 하지만 검사 베르트랑은 생각지도 못한 죄를 들추어낸다. 과연 아나톨은 사형, 아니 다시 태어나야 하는 <삶의 형>을 피할 수 있을 것인가?",
    
    "영국 모더니즘 문학의 대표 작가이자 선구적 페미니스트인 버지니아 울프의 장편소설 『올랜도』가 영문학 번역가 이미애 씨의 번역으로 열린책들에서 출간되었다. 열린책들 세계문학 시리즈의 254번째 책이다.<br>『올랜도』는 울프의 대표작 중 하나인 걸작 환상 소설로, 시인의 기질을 지닌 귀족 청년 올랜도가 어느 날 갑자기 남성에서 여성으로 변한 후 수백 년의 세월을 살아온 신비로운 일대기를 다룬 소설이다. 16세기 영국에서 엘리자베스 1세 여왕의 총애를 받는 미소년이었던 올랜도가 17세기 후반 대사로 파견된 콘스탄티노플에서 여자로 변한 후, 집시들과 생활하다 영국으로 돌아와 18세기, 19세기를 거쳐 20세기 초(1928년) 아이를 낳고 시집을 출간한 한 여성의 삶을 살아가기까지의 긴 여정이 펼쳐진다. 이처럼 한 인물이 다른 성(性)을 모두 경험하고 여러 시대의 사회적 환경 속에서 다양한 정체성을 가지고 살아가는 판타지적인 전개의 이야기를 통해, 성 정체성이란 확고부동한 것이 아니라 환경에 따라 유동적이고 복잡다단하게 발현되는 것임을 드러내는 울프의 양성적(兩性的) 상상력의 정수를 보여 주고 있는 작품이다.<br>표면적으로 전기 양식을 표방하면서도 일반적인 전기적 사실과는 다른 환상적 플롯을 전개함으로써 전기 장르를 유희적으로 풍자하고 있으며, 3백 년이 넘는 통시대적 설정을 통해 주인공 올랜도가 진정한 자아를 찾아가는 기나긴 모험의 여정을 그렸다는 점에서 성장 소설이라고도 할 수 있다. 올랜도는 성별을 바꾸어 여러 시대와 사회를 넘나들면서 각 사회의 관습이나 제도, 규범이 절대적인 것이 아니라 제각기 고유한 시대적・사회적 산물임을 인식하게 된다. 그 과정에서 그는 각 사회의 가치와 성적 규범에 환멸을 느끼며 자신의 고정 관념이나 허위의식을 하나씩 벗어 버리면서 진정한 자아를 추구해 나간다.<br>1993년 샐리 포터 감독에 의해 이 작품이 영화로 제작되어 화제를 모았으며(틸다 스윈턴 주연), 그밖에도 연극이나 오페라로도 활발히 각색되며 많은 이들의 사랑을 받았다. 또 성전환을 겪는 주인공을 통해 성 정체성의 문제를 중점적으로 제기하고 있는 만큼, 여성학이나 동성애, 젠더 연구 등에서 각별한 주목을 받고 있는 작품이다."
]

$(function () {
    var wbg = $(".wbg .bsintro");

    var bstxt = $(".bstxt_tit");
    
    

    bstxt.click(function (e) {
        e.preventDefault();
        $(".wbg").show();
        //베스트셀러 사진 주소
        var bsimg_html = $(this).parent().parent().parent().find(".bsimg").html();
        //console.log(bsimg_html);
    wbg.find(".bsintro_img").empty().append(bsimg_html);
        
        //베스트셀러 이름주소
        var bstxt_name = $(this).find("a").html();
    wbg.find("h2").empty().append(bstxt_name);
        
        //h3에 바로 설명넣기
        var bsnumber = $(this).parent().parent().parent().index();
    wbg.find("h3").empty().append(bsh3[(bsnumber-1)]);
        //console.log(bsnumber);
        
        //p 설명넣기
        wbg.find("p").empty().append(bspp[(bsnumber-1)]);
    });///////////베스트셀러 제목 클릭시////////////


    $(".bsintro_x").click(function (e) {
        e.preventDefault();
        $(".wbg").slideUp(500);
    });


    





}); /*제이쿼리영역*/
